Repository: tejpateleww/Flicha_Driver_iOS_Team_KV
Catalog: Storyboard/*.lproj/Localizable.strings
Languages: sw

# App Name
source: TanTaxi Driver
sw: Dereva wa TanTax

source: Sorry! Not connected to internet
sw: Hakuna Intaneti

source: Success Message
sw: Taarifa

source: Error Message
sw: Taarifa

source: Submit
sw: Tuma

source: Dismiss
sw: ONDOKA

source: System Alert
sw: Taarifa

source: OK
sw: Sawa

source: Mobile Number
sw: Namba za simu

source: Forgot Password?
sw: Umesahau Password?

source: Sign In
sw: Ingia

source: Don't have an Account?
sw: Huna akaunti?

source: Sign Up
sw: Jisajili

source: Forgot Password!
sw: Umesahau Password!

source: Please enter mobile number
sw: Tafadhali ingiza namba ya simu

source: Please enter valid mobile number
sw: Tafadhali ingiza namba sahihi ya simu

source: Please enter email
sw: Tafadhali ingiza email

source: Please enter a valid email
sw: Tafadhali ingiza email sahihi

source: Please enter password
sw: Tafadhali ingiza Password

source: Password must contain at least 8 characters.
sw: Password iwe na hefuri angalau 8.

source: Please enter confirm password
sw: Tafadhali ingiza password tena

source: Password and confirm password must be same
sw: Password zote zinatakiwa zinafanane

source: Please enter OTP
sw: Tafadhali ingiza OTP

source: Resend OTP
sw: Tuma tena OTP

source: Please enter correct OTP
sw: Tafadhali ingiza OTP sahihi

source: Please try to login again
sw: Tafadhali jaibu kuingia tena

source: User Name
sw: Jina la mtumiaji

source: Please enter user name
sw: Jina la mtumiaji

source: Select date of birth
sw: Chagua tarehe ya kuzaliwa

source: Please enter date of birth
sw: Ingiza tarehe ya kuzaliwa

source: Please enter address
sw: Ingiza anuani

source: Male
sw: Mme

source: Female
sw: Mke

source: Post Code (Optional)
sw: Post code (sio lazima)

source: Invite Code (Optional)
sw: Alama ya ukaribisho (sio lazima)

source: Next
sw: Mbele

source: Please enter account holder name
sw: Tafadhali ingiza jina la mwenye akaunti

source: Please enter bank name
sw: Tafadhali ingiza jina la Benki

source: Please enter bank branch
sw: Tafadhali ingiza jina la Tawi la Benki

source: Please enter account number
sw: Tafadhali ingiza Namba ya Akaunti

source: Account Holder Name
sw: Jina la Mwenye Akaunti

source: Bank Name
sw: Jina la Benki

source: Bank Branch
sw: Jina la Tawi

source: Account Number
sw: Namba ya Akaunt

source: Please select vehicle image
sw: Tafadhali chagua picha ya gari

source: Please enter vehicle plate number
sw: Tafadhali ingiza namba ya gar

source: Please enter vehicle model
sw: Tafadhali ingiza modeli ya gari

source: Please enter vehicle make
sw: Tafadhali ingiza kampuni ya gari

source: Please select vehicle type
sw: Tafadhali ingiza aina ya gari

source: Please enter no of passenger
sw: Tafadhali ingiza idadi ya abiria

source: You have to select vehicle type
sw: Unatakiwa kuchagua aina ya gari

source: You can only select three types
sw: Unaruhusiwa kuchagua aina tatu tu

source: Please enter all document's detail.
sw: Tafadhali ingiza taarifa za nyaraka zote

source: Please select vehicle registration document
sw: Tafadhali ingiza nyaraka za usajili wa gari

source: Please add expiry date
sw: Tafadhali ingiza tarehe ya mwisho

source: Select driver licence expiry date
sw: Tafadhali ingiza tarehe ya mwisho ya leseni

source: Select revenue licence expiry date
sw: Chagua tarehe ya mwisho wa leseni

source: Select car registration expiry date
sw: Chagua tarehe ya mwisho wa usajili wa gari

source: Select vehicle insurance/policy expiry date
sw: Chagua tarehe ya mwisho wa Bima

source: Select TIN Certificate expiry date
sw: Chagua tarehe ya kumalizika kwa Cheti cha TIN

source: My Jobs
sw: Kazi zangu

source: Payment Options
sw: Aina za kulipa

source: My Ratings
sw: Ratings zangu

source: Invite Friends
sw: Karibisha Marafiki

source: Trip to Destination
sw: Safari hadi Mwisho

source: Logout
sw: Toka

source: Legal
sw: Sheria

source: Support
sw: Usaidizi

source: Terms & Conditions
sw: Vigezo na Masharti

source: Privacy Policy
sw: Sera ya Faragha

source: First, you have to stop your private meter trip.
sw: Kwanza, unatakiwa usimamishe mita yako ya safari

source: Session Expire
sw: Muda umepita

source: Your session has been expired, please try to login again.
sw: Muda wako umepita, jaribu kuingia tena.

source: Grand Total is
sw: Jumla kuu ni

source: Trip has been cancelled.
sw: Safari imesitishwa

source: Sim card not available
sw: Kadi ya simu haipo

source: Sim state network locked
sw: Kadi ya simu haipo

source: Sim state pin required
sw: PIN ya kadi ya simu inatakiwa

source: Sim state puk required
sw: PUK ya simu inatakiwa

source: Sim state unknown
sw: Sim card haijulikani

source: First, you have to be offline!
sw: Kwanza, unatakiwa utoke!

source: We can not detect your current location. Please check your location services.
sw: Hatuwezi badili mahala ulipo. Tafadhali angalia tena.

source: You are already on Your trip, first finished your trip
sw: Tayari upo safarini, kwanza maliza safari yako

source: Please stay connected to app, until finish the trip! may be you can loose your data.
sw: Tafadhali usitoke hadi utakapomaliza safari, Labda kama ukipoteza mawasiliano.

source: Passenger Info
sw: Taarifa za Abiria

source: Drop off location
sw: Sehemu ya kushusha

source: Pick up location
sw: Sehemu ya kupakiza

source: Flight No
sw: Number ya Ndege

source: Notes
sw: Taarifa za Abiria

source: Receive Request
sw: Pokea Ombi

source: Cancel Request
sw: Sitisha Ombi

source: Reject
sw: Kataa

source: Accept
sw: Pokea

source: New booking request arrived
sw: Ombi jipya limewasili

source: Grand Total:
sw: Jumla Kuu ni:

source: Trip Info
sw: Taarifa za safari

source: Base Fare
sw: Bei ya Kwanza

source: Trip Distance
sw: Umbali wa Safari

source: Distance Fare
sw: Bei ya Umbali

source: Special Extra Charge
sw: SGharama za ziada

source: Booking Charge:
sw: Bei ya Kuomba Safari:

source: Grand Total
sw: Jumla Kuu

source: Current Location
sw: Eneo la sasa

source: Get online First.
sw: Ingia hewani kwanza.

source: You
sw: Wewe

source: Passenger
sw: Abiria

source: Destination Location
sw: Jina la Mahali

source: Distance
sw: Umbali

source: Alert! This is a cash job
sw: Tahadhari! Hii Safari ni ya Pesa Taslimu

source: Please Collect Money From Passenger
sw: Tafadhali Chukua Pesa Kutoka Kwa Abiria

source: Warning
sw: Tahadhari

source: How was your Ride?
sw: Safari ilikuwaje?

source: How was your Ride with
sw: Safari ilikuwaje na

source: Write a comment
sw: Andika mawazo yako

source: Are you sure you want to cancel the trip?
sw: Una uhakika unataka kukatiza safari?

source: Profile Update
sw: Boresha Taarifa

source: Full Name
sw: Jina kamili

source: Profile
sw: Taarifa

source: Updated successfully.
sw: Umefanikiwa kuboresha

source: New Picture
sw: Picha mpya

source: Gender
sw: Jinsia

source: Change Password
sw: Badili Password

source: Save
sw: Hifadhi

source: Account
sw: Akaunti

source: Vehicle Option
sw: Gari

source: picker
sw: Kichukuzi

source: Number Of Passenger
sw: Idadi ya Abiria

source: Choose Photo
sw: Chagua picha

source: Select photo from gallery
sw: Chagua picha kutoka kwa Gallery

source: Select photo from camera
sw: Chagua picha kutoka kwa Kamera

source: No media selected
sw: Hakuna media imechaguliwa

source: Referral Amount
sw: Kiasi Cha Referral

source: When a friend rides with your code
sw: Wakati Rafiki Akitumia Code Yako

source: Share Your Invite Code
sw: Sambaza code yako

source: Share
sw: Sambaza

source: has invited you to become a
sw: amekukuaribisha wewe kuwa

source: Your invite code is:
sw: Code yako ya Ukaribisho ni:

source: Need camera permission!
sw: Ruhusa inatakiwa ya Kamera!

source: This App need camera permission!
sw: App hii inataka ruhusa ya Kamera!

source: Granted
sw: Imeruhusiwa

source: Balance
sw: Salio

source: Transfer
sw: Hamisha

source: Cards
sw: Kadi

source: Top Up
sw: Ongezo

source: Transfer To Bank
sw: Hamisha kwenda Benki

source: History
sw: Historia

source: Available Funds
sw: Pesa iliyopo

source: Please enter amount
sw: Tafadhali ingiza kiasi

source: Select Card
sw: Chagua kadi

source: Card List
sw: Orodha ya Kadi

source: Add New Card
sw: Ongeza kadi

source: Tax
sw: Ushuru

source: Please enter Send amount.
sw: Tafadhali ingiza kiasi unachotuma

source: Please tab to activate Scanner.
sw: Tafadhali bonyeza kuiamsha scanner

source: Send Money
sw: Tuma pesa

source: Receive Money
sw: Pokea pesa

source: Name
sw: Jina

source: Mobile No
sw: Namba ya simu

source: Tap to activate Scanner
sw: Tafadhali bonyeza kuiamsha scanner

source: Comment
sw: Maoni

source: Please ensure you have entered your payment detail correctly.
sw: Tafadhali hakikisha umeingiza taarifa za malipo sawasawa

source: Invalid card number.
sw: Namba ya kadi si sahihi

source: Card Number
sw: Namba ya kadi

source: Expiry Date (MM/YY)
sw: Tarehe ya Mwisho (Mwezi/Mwaka)

source: Reset Password
sw: Rekebisha Password

source: Transaction Failed
sw: Malipo hayakufanikiwa

source: Pending
sw: Inasubiri

source: Future Booking
sw: Maombi ya baadae

source: Pending Jobs
sw: Kazi zinazosubiri

source: Past Jobs
sw: Kazi za zamani

source: No data found.
sw: Hakuna taarifa zilizopatikana.

source: Booking Id
sw: Kitambulisho cha Maombi

source: Pick Up Time:
sw: Muda wa Kuchukua:

source: Pick Up Time
sw: Muda wa Kuchukua

source: Dropoff Time:
sw: Muda wa Kushusha:

source: Distance Travel:
sw: Umbali wa Safari:

source: Booking Fee:
sw: Bei ya Maombi:

source: Base Fare:
sw: Bei ya Kwanza:

source: Time Cost:
sw: Gharama ya Muda:

source: Sub Total:
sw: Nusu Jumla:

source: Plus Extra Charges:
sw: Jumlisha Gharama za ziada:

source: Cancellation Charge:
sw: Tozo za kusitisha Safari:

source: Payment Type:
sw: Aina ya Njia ya Malipo:

source: Promo credit used:
sw: Promo code iliyotumika:

source: Total Paid to Driver:
sw: Jumla ya kiasi kilicholipwa kwa Dereva:

source: Tax:
sw: Ushuru:

source: Waiting Time:
sw: Muda wa Kusubiri:

source: Waiting Cost:
sw: Gharama za Muda wa Kusubir:

source: Discount:
sw: Punguzo:

source: Trip Status:
sw: Hali ya Safari:

source: Select Vehicle Type
sw: Chagua Aina ya Safari

source: Weekly Earning
sw: Mapato ya Wiki

source: Send Otp
sw: Tuma OTP

source: Send OTP
sw: Tuma OTP

source: Enter Mobile OTP
sw: Ingiza OTP ya Simu

source: Date Of Birth
sw: Tarehe ya Kuzaliwa

source: Address
sw: Anuani

source: Vehicle Plate Number
sw: Namba za Gari

source: Vehicle Model
sw: Modeli ya Gari

source: Vehicle Type
sw: Aina ya Gari

source: Vehicle Make
sw: Kampuni ya Gari

source: Driver Licence (Front only)
sw: Leseni ya Dereva (Kwa mbele tu)

source: Revenue Licence
sw: Kadi ya Mlipa Kodi

source: TIN Certificate
sw: Cheti cha TIN

source: Vehicle Registration Document
sw: Nyaraka za Usajili wa Gari

source: Vehicle Insurance Policy/Certificate
sw: Kadi ya Bima ya Gari

source: New Password
sw: Password Mpya

source: Confirm Password
sw: Idhinisha Password

source: Bank Account No.
sw: Namba za Akaunti ya Benki

source: Please try again later.
sw: Tafadhali jaribu tena

source: Cancel
sw: Sitisha

source: Home
sw: Nyumbani

source: Dispatch
sw: Peleka

source: My Job
sw: Kazi zangu

source: Hailed Fare
sw: Bei ya kuita taxi

source: Pay
sw: Lipa

source: Please select which vehicle classes you are a part of.
sw: Tafadhali chagua class ya gari lako.

source: Select up to classes of 4-door vehicles.
sw: Chagua madaraja ya magari ya milango 4.

source: You must be 21 years of age or over.
sw: Angalau uwe na miaka 21 au zaidi.

source: Please select which delivery classes you are a part of.
sw: Tafadhali chagua aina ya delivery class.

source: You must be 18 years of age or over as per
sw: Angalau uwe na miaka 18 au zaidi

source: Driver term and condition.
sw: Vigezo na Masharti vya Dereva

source: Select up to three vehicles.
sw: Chagua hadi magari matatu.

source: Documents
sw: Nyaraka

source: Edit Profile
sw: Kurasa

source: Current Balance
sw: Salio lililopo

source: Add a Card
sw: Ongeza kadi

source: Add Card
sw: Ongeza kadi

source: Start Trip
sw: Anza safari

source: Cancel Trip
sw: Sitisha safari

source: Complete Trip
sw: Maliza safar

source: Hold Trip
sw: Ishikilie safari

source: Stop waiting
sw: Wacha kusubiri

source: Trip has been canceled by passenger.
sw: Safari imesitishwa na Abiria.

source: Movies
sw: Sinema

source: Do you want to off the Trip To Destination option?
sw: Unataka Kutoka kichaguzi cha Trip to Destination?

source: Create Passcode
sw: Unda Passcode

source: Retype Passcode
sw: Iingize tena Passcode

source: Passcode Required
sw: Passcode inatakiwa

source: Enter old password
sw: Ingiza Password ya zamani

source: Something went wrong!
sw: Kitu fulani kilikuwa kibaya!

source: Please select Profile pic
sw: Tafadhali chagua Picha ya Ukurasa

source: Set Amount
sw: Weka Kiwango

source: Please enter Customer Name.
sw: Tafadhali ingiza jina la Mteja

source: Please enter Customer Mobile No.
sw: Tafadhali ingiza namba ya simu ya Mteja

source: Please enter Pick Up Location.
sw: Tafadhali ingiza sehemu unayochukuliwa

source: Please enter a Destination.
sw: Tafadhali ingiza sehemu unayokwenda

source: Please enter Fare Amount.
sw: Tafadhali chagua Bei

source: Please select Model Type.
sw: Tafadhali chagua Modeli ya Gari

source: Please select Date and Time.
sw: Tafadhali chagua Tarehe na Muda

source: Please select at least one vehicle type.
sw: Tafadhali chagua angalau aina moja ya Gari

source: (incl tax)
sw: (pamoja na ushuru)

source: No
sw: Hapana

source: Yes
sw: Ndio

source: Direction
sw: Maelekezo

source: Estimate Fare
sw: Tathmini Fare

source: Tip by Passenger:
sw: Kidokezo na Abiria:

source: Thanks for feedback.
sw: Asante kwa mrejesho.
